
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/scarowar/test-tf-branch-deploy/actions/runs/20718990734)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = <<-EOT
            Environment: prod
            Message: Production environment test
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./output.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + environment = "prod"
  + file_path   = "./output.txt"
local_file.test: Creating...
local_file.test: Creation complete after 0s [id=9516e9afae0bcad70e03868420e0a11f59d58c99]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

environment = "prod"
file_path = "./output.txt"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":12,"Program":"tfcmt","SHA1":"3130d424b01050dd11f302eccdecd5c17f9910f3","Vars":{},"WorkflowName":"2️⃣ Advanced Deploy (With Hook)"} -->